examples/request1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:id="http://x-road.eu/xsd/identifiers" xmlns:sdsb="http://x-road.eu/xsd/sdsb.xsd">
    <SOAP-ENV:Header>
        <sdsb:client id:objectType="SUBSYSTEM">
            <id:sdsbInstance>FI_TEST</id:sdsbInstance>
            <id:memberClass>GOV</id:memberClass>
            <id:memberCode>1234567-8</id:memberCode>
        </sdsb:client>
        <sdsb:service id:objectType="SERVICE">
            <id:sdsbInstance>FI_TEST</id:sdsbInstance>
            <id:memberClass>GOV</id:memberClass>
            <id:memberCode>9876543-1</id:memberCode>
            <id:subsystemCode>DemoService</id:subsystemCode>
            <id:serviceCode>helloService</id:serviceCode>
            <id:serviceVersion>v1</id:serviceVersion>
        </sdsb:service>
        <sdsb:userId>jdoe</sdsb:userId>
        <sdsb:id>f833878f-2d25-4b49-9c62-a0dfcc732f68</sdsb:id>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ts:helloService xmlns:ts="http://test.x-road.fi/producer">
            <ts:request>
                <ts:name>Test message</ts:name>
            </ts:request>
        </ts:helloService>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>